In [4]:
import pandas as pd
import numpy as np

In [6]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [7]:
new_obj = obj.drop('c')

In [8]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [30]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), 
                    index=['Ohio', 'Korea', 'Seoul', 'New York'],
                    columns=['one', 'two', 'three', 'Four'])

In [31]:
data

          one  two  three  Four
Ohio        0    1      2     3
Korea       4    5      6     7
Seoul       8    9     10    11
New York   12   13     14    15

In [32]:
data.drop('Korea', inplace=True)

In [33]:
data

          one  two  three  Four
Ohio        0    1      2     3
Seoul       8    9     10    11
New York   12   13     14    15

In [34]:
data.drop('Ohio')

          one  two  three  Four
Seoul       8    9     10    11
New York   12   13     14    15

In [35]:
data

          one  two  three  Four
Ohio        0    1      2     3
Seoul       8    9     10    11
New York   12   13     14    15